app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kaas kopen"], ["content", "Koop kaas bij kaasboer"], ["created_at", "2016-03-01 12:01:22.168303"], ["updated_at", "2016-03-01 12:01:22.168303"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Ivy Kilbook"], ["updated_at", "2016-03-01 15:46:16.047818"], ["id", 414]]
---
  def update
    if @task.update(task_params)